#  ██████╗ █████╗ ██╗      ██████╗
# ██╔════╝██╔══██╗██║     ██╔════╝
# ██║     ███████║██║     ██║     
# ██║     ██╔══██║██║     ██║     
# ╚██████╗██║  ██║███████╗╚██████╗
#  ╚═════╝╚═╝  ╚═╝╚══════╝ ╚═════╝

# Πρόγραμμα που υλοποιεί απλές πράξεις μεταξύ δύο αριθμών
# Ορισμός συναρτήσεων για τις πράξεις

# Συνάρτηση για την πρόσθεση
def add(a,b):
    return a + b

# Συνάρτηση για την αφαίρεση
def sub(a,b):
    return a - b

# Συνάρτηση για τον πολλαπλασιασμό
def multi(a,b):
    return a * b

# Συνάρτηση για την διαίρεση
def divid(a,b):
    return a / b

# Συνάρτηση για το παραγοντικό
def fact(n):
    # Έλεγχος για τον ορισμό του παραγοντικού
    if n == 0:
        return 1
    else:
        # Αναδρομική κλήση της συνάρτησης για τον υπολογισμό του παραγοντικού του n αριθμού, n!
        return n * fact(n-1)



# Επιλογή πράξης και εκτέλεση
while True:
    # Εκτύπωση μενού
    print("------------------")
    print("1. Πρόσθεση")
    print("2. Αφαίρεση")
    print("3. Πολλαπλασιασμός")
    print("4. Διαίρεση")
    print("5. Παραγοντικό")
    print("6. Έξοδος")
    print("------------------")
    # Επιλογή πράξης
    method = input("Δώσε αντίστοιχο αριθμό για την πράξη που επιθυμείς να εκτελεστεί (1,2,3,4,5,6): ")
    print("---")
    # Έλεγχος επιλογής
    if method == "6":
        # Έξοδος
        print("Exiting...")
        # Έξοδος από το loop
        break
    # Εκτέλεση πράξης
    if method in ("1","2","3","4","5"):
        # Εισαγωγή αριθμών
        a = int(input("Δώσε τιμή για αριθμό α: "))
        b = int(input("Δώσε τιμή για αριθμό β: "))
        print("---")
        # Εκτέλεση πράξης
        if method == "1":
            print(a," + ",b," = ",add(a,b))
        elif method == "2":
            print(a," - ",b," = ",sub(a,b))  
        elif method == "3":
            print(a," * ",b," = ",multi(a,b))  
        elif method == "4":
            # Έλεγχος διαιρέσης με μηδέν
            if b != 0:
                print(a," / ",b," = ",divid(a,b))
            else:
                print("Δεν γίνεται η πράξη ",a,"/",b," επειδή ο παρονομαστής είναι ",b)
        elif method == "5":
            num_choice = input("Θέλεις να υπολογίσεις το παραγοντικό του α ή του β (a/b): ")
            if num_choice == "a":
                print("Το παραγοντικό του", a, "είναι", fact(a))
            elif num_choice == "b":
                print("Το παραγοντικό του", b, "είναι", fact(b))
            else:
                print("Μη έγκυρη επιλογή")

        print("---")
        # Επανάληψη πράξης ή έξοδος
        epomeno = input("Θέλεις να κάνεις άλλη πράξη (yes/no): ")
        # Έλεγχος επιλογής
        if epomeno == "no":
            # Έξοδος από το loop
            break
    else:
        # Λάθος επιλογή
        print("Χάλασε το πρόγραμμα...")