## Συνάρτηση για τον υπολογισμό του παραγοντικού ενός αριθμού
def calculate_factorial(number):
    ## Έλεγχος για αρνητικούς αριθμούς
    if number < 0:
        ## Εκτύπωση μηνύματος σφάλματος
        print("Σφάλμα: Για αρνητικούς αριθμούς δεν ορίζεται παραγοντικό.")
        ## Επιστρέφουμε None ως ένδειξη σφάλματος
        return None
    
    ## Αρχικοποίηση του παραγοντικού
    factorial = 1
    ## Υπολογισμός του παραγοντικού
    for i in range(1, number + 1):
        factorial = factorial * i
    ## Επιστροφή του παραγοντικού
    return factorial

## Συνάρτηση main
def main():
    ## Είσοδος αριθμού από το χρήστη
    number = int(input("Δώσε έναν αριθμό: "))
    ## Κλήση της συνάρτησης για τον υπολογισμό του παραγοντικού
    factorial = calculate_factorial(number)
    ## Έλεγχος για το αν η συνάρτηση επέστρεψε τιμή
    if factorial :
        ## Εκτύπωση του παραγοντικού του αριθμού αφού έχει γίνει ο έλεγχος
        print("Το παραγοντικό του αριθμού", number, "είναι", factorial)

## Κλήση της main
main()