def fibo(n):
	# Υπολογίστε τον n-οστό αριθμό Fibonacci χρησιμοποιώντας αναδρομή
	if n <= 1:
		return n # Βασική περίπτωση: αν n είναι 0 ή 1
	return fibo(n - 1) + fibo(n - 2) # Αναδρομική κλήση για να υπολογίσει το F(n) = F(n-1) + F(n-2)

def main():
	# Λήψη του αριθμού των όρων της ακολουθίας Fibonacci από τον χρήστη
	terms = int(input("Εισάγετε τον αριθμό των όρων που θέλετε στην ακολουθία: "))
	# Ελέγχει αν ο χρήστης έδωσε έγκυρο θετικό αριθμό όρων
	if terms <= 0:
		print("Πληκτρολογήστε έναν θετικό ακέραιο αριθμό.") # Ενημέρωση για μη έγκυρη είσοδο
	else:
		# Εκτύπωση της ακολουθίας Fibonacci για τον αριθμό των όρων που εισήχθη
		print("Η ακολουθία Fibonacci είναι: ")
		for i in range(terms):
			print(fibo(i), end=" ") # Εκτυπώνει τον n-οστό όρο Fibonacci χωρίς αλλαγή γραμμής

# Εκτέλεση της κύριας συνάρτησης
main()