# Δημιουργία της λίστας με τα στοιχεία
mylist = [4, 2, 7, 4, 5, 6, 7, 7, 9, 10]
# Αρχικοποίηση μετρητή για τον αριθμό επαναλήψεων
count = 0
# Αρχικοποίηση της μεταβλητής για την μικρότερη τιμή
mikro = mylist[0]
# Ζητάμε από τον χρήστη να εισάγει έναν αριθμό για να μετρήσουμε πόσες φορές επαναλαμβάνεται στην λίστα
num = int(input("Δώσε τιμή για να δεις πόσες φορές επαναλαμβάνεται στην λίστα: "))
# Επανάληψη για κάθε τιμή στην λίστα
for timh in mylist:
	# Αν η τιμή είναι ίση με τον αριθμό που εισήγαγε ο χρήστης, αυξάνουμε τον μετρητή
	if timh == num:
		count += 1
	# Αν η τιμή είναι μικρότερη από την τρέχουσα μικρότερη τιμή, την ενημερώνουμε
	if timh < mikro:
		mikro = timh

# Εκτύπωση της μικρότερης τιμής από την λίστα
print("Η μικρότερη τιμή στην λίστα είναι: ",mikro)
# Εκτύπωση του αριθμού επαναλήψεων του αριθμού στην λίστα
print("Ο αριθμός",num,"επαναλαμβάνεται στην λίστα",count,"φορές")